habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
/** ****************************************************************************************************
 * @file            ADC_Support.c
 * @brief           A collection of functions relevant to the ADC peripheral channels and their conversions
 * ****************************************************************************************************
 * @author original Hab Collector (habco)\n
 *
 * @version         See Main_Support.h: FW_MAJOR_REV, FW_MINOR_REV, FW_TEST_REV
 *
 * @param Development_Environment \n
 * Hardware:        <STM32F764G-DISCO> \n
 * IDE:             STMCubeIDE VER 1.17.0 \n
 * Compiler:        GCC \n
 * Editor Settings: 1 Tab = 4 Spaces, Recommended Courier New 11
 *
 * @note            The associated header file provides MACRO functions for IO control
 *
 *                  This is an embedded application
 *                  It will be necessary to consult the reference documents to fully understand the code
 *                  It is suggested that the documents be reviewed in the order shown.
 *                    Schematic: IMR-005-SCH
 *                    STM32F746G_DISCO
 *                    IMR Engineering
 *
 * @copyright       IMR Engineering, LLC
 ********************************************************************************************************/

#include "ADC_Support.h"
#include "Main_Support.h"
#include "IO_Support.h"
#include "Terminal_Emulator_Support.h"
#include "MCP45HVX1_Driver.h"
#include "stm32f7xx_hal_adc.h"
#include "cmsis_os2.h"
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include <math.h>

extern ADC_HandleTypeDef hadc1;
extern ADC_HandleTypeDef hadc3;

// Global
uint16_t ADC1_CountValue[ADC1_NUMBER_OF_CHANNELS];
uint16_t ADC3_CountValue[ADC3_NUMBER_OF_CHANNELS];
static double System_ADC_Reference = ADC_REFERENCE_VOLTAGE;     // Init condition - it will be updated later in calculation of ADC1 3V3

// Static Function Declarations
static Type_16b_FIFO *Init_FIFO_Buffer(uint16_t *Buffer, uint8_t BufferLength, uint16_t InitLoadValue);
static Type_RMS *Init_RMS_Class(float *Buffer, uint16_t BufferLength);
static void writeTo_FIFO_Buffer(Type_16b_FIFO *Buffer, uint16_t Value);
static double calculateSystem_3V3(void);
static double calculateSystemTemp(void);
static double calculateSystemSupply(Type_16b_FIFO *FIFO_SupplyRail);
static void calculateChannelCurrent(double ADC_AmpMonitorCount, Type_16b_FIFO *FIFO_AmpMon, Type_ChannelConfig *ChannelMeasure, Type_RMS *RMS_AmpMon);
static void calculateChannelVoltage(double ADC_VoltMonitorCount, Type_16b_FIFO *FIFO_VoltMon, Type_ChannelMeasure *VoltageMeasure, Type_RMS *RMS_VoltMon);

// Static FIFO Declarations
// System 3V3
static uint16_t BufferSystem_3V3[SYSTEM_3V3_BUFFER_SIZE] = {0x0000};
static Type_16b_FIFO *FIFO_System_3V3;
// System Temperature
static uint16_t BufferSystemTemp[SYSTEM_TEMP_BUFFER_SIZE] = {0x0000};
static Type_16b_FIFO *FIFO_SystemTemp;
// Positive VS Supply Rail Monitor
static uint16_t Buffer_PVS_Supply[SYSTEM_PVS_BUFFER_SIZE] = {0x0000};
static Type_16b_FIFO *FIFO_PVS_Supply;
// Negative VS Supply Rail Monitor
static uint16_t Buffer_NVS_Supply[SYSTEM_NVS_BUFFER_SIZE] = {0x0000};
static Type_16b_FIFO *FIFO_NVS_Supply;
// CH1 Current Monitor
static uint16_t Buffer_CH1_AmpMon[CH1_AMP_MON_BUFFER_SIZE] = {0x0000};
static Type_16b_FIFO *FIFO_CH1_AmpMon;
// CH2 Current Monitor
static uint16_t Buffer_CH2_AmpMon[CH2_AMP_MON_BUFFER_SIZE] = {0x0000};
static Type_16b_FIFO *FIFO_CH2_AmpMon;
// CH1 Current Monitor
static uint16_t Buffer_CH1_VoltMon[CH1_VOLT_MON_BUFFER_SIZE] = {0x0000};
static Type_16b_FIFO *FIFO_CH1_VoltMon;
// CH2 Current Monitor
static uint16_t Buffer_CH2_VoltMon[CH2_VOLT_MON_BUFFER_SIZE] = {0x0000};
static Type_16b_FIFO *FIFO_CH2_VoltMon;

// Static RMS Struct Declarations
static float CH1_AmpMonBuffer[RMS_WINDOW_SIZE];
static Type_RMS *RMS_CH1_AmpMon;
static float CH2_AmpMonBuffer[RMS_WINDOW_SIZE];
static Type_RMS *RMS_CH2_AmpMon;
static float CH1_VoltMonBuffer[RMS_WINDOW_SIZE];
static Type_RMS *RMS_CH1_VoltMon;
static float CH2_VoltMonBuffer[RMS_WINDOW_SIZE];
static Type_RMS *RMS_CH2_VoltMon;


/********************************************************************************************************
* @brief Init the ADC for ADC1 (2 channels) and ADC3 (3 channels).
* ADC1 handles:
*    Temperature
*    3.3V measurement
* ADC3 handles:
*    -VS Supply Rail
*    +VS Supply Rail
*    CH1 Current Monitor
*    CH2 Current Monitor
*    CH1 Voltage Monitor
*    CH2 Voltage Monitor
*
* @author original: Hab Collector \n
*
* @note: ADC1 is set in DMA single shot conversion mode - software start required for new conversion
* @note: ADC3 is set in DMA continuous conversion mode - continuous non-stop conversions once started
* @note: See the ADC DMA callback HAL_ADC_ConvCpltCallback
* @note: The STM32F series makes no provision for a calibration as it is trimmed by the factory
* @note: See function ADC13_StartConversion() - which actually starts the conversion
* @note: See also ArbPwrBooster member Ready
*
* STEP 1: Enable Internal reference and temperature measure
* STEP 2: Init FIFO Buffers for use with ADC1: Micro-Temp Sensor, System 3.3V
* STEP 3: Init FIFO Buffers for use with ADC3: ±VS rail, CH1 & CH2 Amp Monitor
* STEP 4: Init RMS structures
********************************************************************************************************/
void Init_ADC_Hardware(void)
{
    // STEP 1: Enable Internal reference and temperature measure
    ADC->CCR |= ADC_CCR_TSVREFE_Msk;

    // STEP 2: Init FIFO Buffers for use with ADC1: Micro-Temp Sensor, System 3.3V
    FIFO_SystemTemp = Init_FIFO_Buffer(BufferSystemTemp, SYSTEM_TEMP_BUFFER_SIZE, 0);
    FIFO_System_3V3 = Init_FIFO_Buffer(BufferSystem_3V3, SYSTEM_3V3_BUFFER_SIZE, ADC_REF_VOLTAGE_COUNT);

    // STEP 3: Init FIFO Buffers for use with ADC3: ±VS rail, CH1 & CH2 Amp Monitor
    FIFO_NVS_Supply = Init_FIFO_Buffer(Buffer_NVS_Supply, SYSTEM_NVS_BUFFER_SIZE, 0);
    FIFO_PVS_Supply = Init_FIFO_Buffer(Buffer_PVS_Supply, SYSTEM_PVS_BUFFER_SIZE, 0);
    FIFO_CH1_AmpMon = Init_FIFO_Buffer(Buffer_CH1_AmpMon, CH1_AMP_MON_BUFFER_SIZE, 0);
    FIFO_CH2_AmpMon = Init_FIFO_Buffer(Buffer_CH2_AmpMon, CH2_AMP_MON_BUFFER_SIZE, 0);
    FIFO_CH1_VoltMon = Init_FIFO_Buffer(Buffer_CH1_VoltMon, CH1_VOLT_MON_BUFFER_SIZE, 0);
    FIFO_CH2_VoltMon = Init_FIFO_Buffer(Buffer_CH2_VoltMon, CH2_VOLT_MON_BUFFER_SIZE, 0);

    // STEP 4: Init RMS structures
    RMS_CH1_AmpMon = Init_RMS_Class(CH1_AmpMonBuffer, RMS_WINDOW_SIZE);
    RMS_CH2_AmpMon = Init_RMS_Class(CH2_AmpMonBuffer, RMS_WINDOW_SIZE);
    RMS_CH1_VoltMon = Init_RMS_Class(CH1_VoltMonBuffer, RMS_WINDOW_SIZE);
    RMS_CH2_VoltMon = Init_RMS_Class(CH2_VoltMonBuffer, RMS_WINDOW_SIZE);

} // END OF Init_ADC_Hardware



/********************************************************************************************************
* @brief Start Conversions for both ADC1 and ADC3.  Note this function should be call only once as part of
* the start up process.  Though ADC1 is configured in single shot mode and the start can be called on the
* completion of every ADC1 conversion, ADC3 is configured in circular mode and does not (should not) be called
* repeatedly as the conversions will automatically restart.
*
* @author original: Hab Collector \n
*
* @note: ADC1 is configured in single shot mode and its conversion rate is based on the rate at which it is called
* @note: ADC3 is configured in circular mode and will automatically restart the conversions
*
* STEP 1: Start ADC 1 & ADC 3 conversion all channels
********************************************************************************************************/
void ADC13_StartConversion(void)
{
    HAL_StatusTypeDef ADC_InitStatus = HAL_OK;

