habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
} // END OF calculateSystemTemp



/********************************************************************************************************
* @brief Calculates the SYSTEM ± supply rail voltage.  The negative supply rail is inverted externally so it is
* read here as a positive value.  If the calling function is passing the negative supply rail FIFO it must
* also multiply the return value by -1.
*
* @author original: Hab Collector \n
*
* @note: External divider ratio of .110 (30V to 3.3V)
* @note: Divider ratio for ±VS is the same
* @note: Nominal supply voltage is 15V
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* @return As a positive number only the supply rail voltage
*
* STEP 1: Calculate the mean of the ADC Supply rail counts
* STEP 2: Using the mean value calculate supply rail according to input divider ratio
********************************************************************************************************/
static double calculateSystemSupply(Type_16b_FIFO *FIFO_SupplyRail)
{
    // STEP 1: Calculate the mean of the ADC Supply rail counts
    double MeanSupplyRailCount = 0.0;
    MeanSupplyRailCount = (double)((double)FIFO_SupplyRail->Sum / FIFO_SupplyRail->Depth);

    // STEP 2: Using the mean value calculate supply rail according to input divider ratio
    double SupplyRailVoltage = MeanSupplyRailCount * LSB_12BIT_VALUE * System_ADC_Reference * SYSTEM_VS_DIVIDER;
    return(SupplyRailVoltage);

} // END OF calculateSystemSupply



/********************************************************************************************************
* @brief Calculates the CHANNEL mean, max, min and RMS current.
*
* @author original: Hab Collector \n
*
* @note: TODO MORE NOTES
* @note: TODO MORE NOTES
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* @param ADC_AmpMonitorCount: ADC Count from ADC channel for the specific current monitor
* @param FIFO_AmpMon: FIFO structure associated with the specific Amp Monitor channel
* @param ChannelMeasure: ArbPwrBooster current measure struct associated with the specific channel
* @param RMS_AmpMon: Associated RMS structure
*
* STEP 1: Calculate the mean of the Current Monitor
* STEP 2: Calculate the instantaneous current
* STEP 3: Update Min current or reset min if so desired
* STEP 4: Update Max current or reset max if so desired
* STEP 5: Calculate the RMS current
********************************************************************************************************/
static void calculateChannelCurrent(double ADC_AmpMonitorCount, Type_16b_FIFO *FIFO_AmpMon, Type_ChannelConfig *ChannelMeasure, Type_RMS *RMS_AmpMon)
{
    double AmpMonitorCurrent = 0;
    ChannelMeasure->Measure.MeanCurrent = 0;
    ChannelMeasure->Measure.RMS_Current = 0;
    if (ChannelMeasure->OutputSwitch == ON)
    {
        // STEP 1: Calculate the mean of the Current Monitor
        double MeanCount_ADC = (double)FIFO_AmpMon->Sum / FIFO_AmpMon->Depth;
        double MeanDiffVolt = ((MeanCount_ADC * LSB_12BIT_VALUE * System_ADC_Reference) - (System_ADC_Reference / 2.0)) / AMP_MONITOR_GAIN;
        ChannelMeasure->Measure.MeanCurrent = MeanDiffVolt / AMP_SENSE_RESISTOR;

        // STEP 2: Calculate the instantaneous current
        double DiffVolt = ((ADC_AmpMonitorCount * LSB_12BIT_VALUE * System_ADC_Reference) - (System_ADC_Reference / 2.0)) / AMP_MONITOR_GAIN;
        AmpMonitorCurrent = DiffVolt / AMP_SENSE_RESISTOR;
    }
    else
    {
        return;
    }

    // STEP 3: Update Min current or reset min if so desired
    if (ChannelMeasure->Measure.ResetCurrentMinMax)
        ChannelMeasure->Measure.MinCurrent = AmpMonitorCurrent;
    else if (AmpMonitorCurrent < ChannelMeasure->Measure.MinCurrent)
        ChannelMeasure->Measure.MinCurrent = AmpMonitorCurrent;

    // STEP 4: Update Max current or reset max if so desired
    if (ChannelMeasure->Measure.ResetCurrentMinMax)
    {
        ChannelMeasure->Measure.MaxCurrent = AmpMonitorCurrent;
        ChannelMeasure->Measure.ResetCurrentMinMax = false;
    }
    else if (AmpMonitorCurrent > ChannelMeasure->Measure.MaxCurrent)
    {
        ChannelMeasure->Measure.MaxCurrent = AmpMonitorCurrent;
    }

    // STEP 5: Calculate the RMS current
    ChannelMeasure->Measure.RMS_Current = ChannelMeasure->Measure.RMS_CurrentFunction(RMS_AmpMon, AmpMonitorCurrent);

} // END OF calculateChannelCurrent



/********************************************************************************************************
* @brief Calculates the CHANNEL mean, max, min and RMS voltage.
*
* @author original: Hab Collector \n
*
* @note: TODO MORE NOTES
* @note: TODO MORE NOTES
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* @param ADC_VoltMonitorCount: ADC Count from ADC channel for the specific voltage monitor
* @param FIFO_VoltMon: FIFO structure associated with the specific Volt Monitor channel
* @param Measure: ArbPwrBooster measure struct associated with the specific channel
* @param RMS_VoltMon: Associated RMS structure
*
* STEP 1: Calculate the mean of the Voltage Monitor
* STEP 2: Calculate the instantaneous voltage
* STEP 3: Update Min voltage or reset min if so desired
* STEP 4: Update Max voltage or reset max if so desired
* STEP 5: Calculate the RMS voltage
********************************************************************************************************/
static void calculateChannelVoltage(double ADC_VoltMonitorCount, Type_16b_FIFO *FIFO_VoltMon, Type_ChannelMeasure *Measure, Type_RMS *RMS_VoltMon)
{
    // TODO Think about a periodic min max reset
    // STEP 1: Calculate the mean of the Voltage Monitor
    double MeanVoltageCount = (double)FIFO_VoltMon->Sum / FIFO_VoltMon->Depth;
    Measure->MeanVoltage = MeanVoltageCount * LSB_12BIT_VALUE * System_ADC_Reference * VOLT_MON_DIVIDER;

    // STEP 2: Calculate the instantaneous voltage
    double VoltMonitorVoltage = ADC_VoltMonitorCount * LSB_12BIT_VALUE * System_ADC_Reference * VOLT_MON_DIVIDER;

