habworks/Arb_Power_Booster/Firmware/ArbPwrBooster_App/STM32CubeIDE/Application/User/App_Support/Src/ADC_Support.c
    // STEP 3: Update Min voltage or reset min if so desired
#ifdef CAL_MIN_MAX_VOLTAGE
    if (Measure->ResetVoltageMinMax)
        Measure->MinVoltage = VoltMonitorVoltage;
    else if (VoltMonitorVoltage < Measure->MinVoltage)
        Measure->MinVoltage = VoltMonitorVoltage;

    // STEP 4: Update Max voltage or reset max if so desired
    if (Measure->ResetVoltageMinMax)
    {
        Measure->MaxVoltage = VoltMonitorVoltage;
        Measure->ResetVoltageMinMax = false;
    }
    else if (VoltMonitorVoltage > Measure->MaxVoltage)
    {
        Measure->MaxVoltage = VoltMonitorVoltage;
    }
#endif

    // STEP 5: Calculate the RMS voltage
    Measure->RMS_Voltage = Measure->RMS_VoltageFunction(RMS_VoltMon, VoltMonitorVoltage);

} // END OF calculateChannelVoltage



void monitorTaskInit(void)
{
    DO_NOTHING();
}


void monitorTaskActions(void)
{
    static bool CriticalSystemError = false;
    // STEP 1: Do nothing until introduction splash screen completed
    if (ArbPwrBooster.Ready)
    {
        // STEP 2: Do nothing if a system error has occurred
        if (!CriticalSystemError)
        {
            // STEP 3: Check that VS supply within limits - if not disable input
            char NotUsedStatusMsg[25] = {0x00};
            uint8_t ConfigError = 0;
            systemMeasureWithinLimits(NotUsedStatusMsg, &ConfigError);
            if ((ConfigError & CONFIG_POS_VS_ERROR) || (ConfigError & CONFIG_NEG_VS_ERROR))
            {
                CH1_INPUT_DISABLE();
                CH2_INPUT_DISABLE();
            }
            else
            {
                CH1_INPUT_ENABLE();
                CH2_INPUT_ENABLE();
            }

            // STEP 4: Check for short circuit conditions

            // STEP 5: Check for current limit conditions

            // STEP 6: Check for critical system error conditions
            // Over Voltage on ±VS supply
            if ((ArbPwrBooster.SystemMeasure.Positive_VS >= SYSTEM_POS_VS_LIMIT) || (ArbPwrBooster.SystemMeasure.Negative_VS <= SYSTEM_NEG_VS_LIMIT))
            {
                CriticalSystemError = true;
                MAIN_PWR_OFF();
                printBrightRed("\r\nERROR: Critical on VS supply rail\r\n");
                printBrightRed("Correct supply rail then reset\r\n");
            }
            // Over Temperature
            if (ArbPwrBooster.SystemMeasure.TempDegreeC >= SYSTEM_TEMP_UPPER_LIMIT)
            {
                CriticalSystemError = true;
                MAIN_PWR_OFF();
                printBrightRed("\r\nERROR: Critical over temperature\r\n");
                printBrightRed("Cool device then reset\r\n");
            }
        }
    }

    // STEP 7: Make task inactive for a period of time
    osDelay(MONITOR_UPDATE_RATE);
}



/********************************************************************************************************
* @brief ADC1 is configured for DMA single shot conversion mode.  At the end of each conversion the ADC must
* be restarted for the next conversion.  Issue this command to start a conversion.  When the conversion is
* completed the results will be handled in HAL_ADC_ConvCpltCallback().  As this is single shot, you must call
* this function at the end of conversion if you want another conversion - and so on and so on.
*
* @author original: Hab Collector \n
*
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* STEP 1: Start ADC 1 conversion all channels in single shot DMA mode
********************************************************************************************************/
void ADC1_StartConversion(void)
{
    // STEP 1: Start ADC 1 conversion all channels in single shot DMA mode
    HAL_ADC_Start_DMA(&hadc1, (uint32_t *)ADC1_CountValue, ADC1_NUMBER_OF_CHANNELS);

}  // END OF ADC1_StartConversion



/********************************************************************************************************
* @brief Checks the system values of +VS, -VS, Temperature and Vref to see if they are within the specified
* limits of operation.  All errors are OR together to the error variable, but only the first error description
* is returned.
*
* @author original: Hab Collector \n
*
* @note: SYSTEM refers to quantities that impact the entire device - CHANNEL impacts on CH1 or CH2
*
* STEP 1: Check System +VS
* STEP 2: Check System -VS
* STEP 3: Check System Vref
* STEP 4: Check System Temperature
* STEP 5: For no error
********************************************************************************************************/
bool systemMeasureWithinLimits(char *ErrorDescription, uint8_t *ErrorNumber)
{
    bool FirstErrorFound = false;
    *ErrorNumber = CONFIG_NO_ERROR;

    // STEP 1: Check System +VS
    if ((ArbPwrBooster.SystemMeasure.Positive_VS > SYSTEM_POS_VS_HIGH) || (ArbPwrBooster.SystemMeasure.Positive_VS < SYSTEM_POS_VS_LOW))
    {
        *ErrorNumber |= (1 << CONFIG_POS_VS_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "+VS: %3.1fV to %3.1fV", SYSTEM_POS_VS_LOW, SYSTEM_POS_VS_HIGH);
            FirstErrorFound = true;
        }
    }

    // STEP 2: Check System -VS
    if ((ArbPwrBooster.SystemMeasure.Negative_VS > SYSTEM_NEG_VS_HIGH) || (ArbPwrBooster.SystemMeasure.Negative_VS < SYSTEM_NEG_VS_LOW))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_NEG_VS_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "-VS: %3.1fV to %3.1fV", SYSTEM_NEG_VS_LOW, SYSTEM_NEG_VS_HIGH);
            FirstErrorFound = true;
        }
    }

    // STEP 3: Check System Vref
    if ((ArbPwrBooster.SystemMeasure.VDD_VDREF > SYSTEM_3V3_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.VDD_VDREF < SYSTEM_3V3_LOWER_LIMIT))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_VREF_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "VREF: %4.3fV to %4.3fV", SYSTEM_3V3_LOWER_LIMIT, SYSTEM_3V3_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 4: Check System Temperature
    if ((ArbPwrBooster.SystemMeasure.TempDegreeC >= SYSTEM_TEMP_UPPER_LIMIT) || (ArbPwrBooster.SystemMeasure.TempDegreeC <= SYSTEM_TEMP_LOWER_LIMIT))
    {
        *ErrorNumber |= (uint8_t)(1 << CONFIG_TEMP_MASK);
        if (!FirstErrorFound)
        {
            sprintf(ErrorDescription, "%dC < Temp < %dC", SYSTEM_TEMP_LOWER_LIMIT, SYSTEM_TEMP_UPPER_LIMIT);
            FirstErrorFound = true;
        }
    }

    // STEP 5: For no error
    if (*ErrorNumber == CONFIG_NO_ERROR)
    {
        sprintf(ErrorDescription, "I'm good how about you.");
        return(true);
    }
    else
    {
        return(false);
    }

} // END OF systemMeasureWithinLimits




/********************************************************************************************************
* @brief RMS calculate function.  This function refers to updating as the RMS value is based on a buffer
* window.  As the buffer is updated with new sample values the RMS output will be updated.  This is a true
* RMS calculation as it computes the square root of the mean sum of squares.
*
* @author original: Hab Collector \n
*
* @note: True RMS calculation
*
* @param RMS_Object: The RMS Object to be operated on
* @param NewSampleValue: New sample for which to update the RMS value
*
* @return: The RMS updated value
*
* STEP 1: Remove the oldest value from sum_squares if buffer is full
* STEP 2: Store new value and update sum of squares
* STEP 3: Calculate the updated RMS
* STEP 4: Move buffer index (circular)
********************************************************************************************************/
double update_RMS_Value(Type_RMS *RMS_Object, double NewSampleValue)
{
    // STEP 1: Remove the oldest value from sum_squares if buffer is full
    if (RMS_Object->Count >= RMS_Object->WindowSize)
        RMS_Object->SumOfSquares = RMS_Object->SumOfSquares - (RMS_Object->BufferWindow[RMS_Object->Index] * RMS_Object->BufferWindow[RMS_Object->Index]);  // Remove old squared value
    else
        RMS_Object->Count = RMS_Object->Count + 1;

    // STEP 2: Store new value and update sum of squares
    RMS_Object->BufferWindow[RMS_Object->Index] = NewSampleValue;
    RMS_Object->SumOfSquares = RMS_Object->SumOfSquares + (NewSampleValue * NewSampleValue);

    // STEP 3: Calculate the updated RMS
    double RMS_CurrentValue = sqrt(RMS_Object->SumOfSquares / RMS_Object->Count);

    // STEP 4: Move buffer index (circular)
    RMS_Object->Index = (RMS_Object->Index + 1) % RMS_Object->WindowSize;

    return(RMS_CurrentValue);

} // END OF update_RMS_Value


//// OLD RMS STUFF TO BE DELETED
//// Circular buffer for storing recent ADC values
//static float BufferWindow_CH1[RMS_WINDOW_SIZE] = {0};
//// Function to update RMS in real-time
//double update_CH1_RMS_Current(double NewSampleValue)
//{
//    static int Index = 0;
//    static int Count = 0;
//    static double SumOfSquares = 0.0;
//
//    double RMS_CurrentValue;
//    // Remove the oldest value from sum_squares if buffer is full
//    if (Count >= RMS_WINDOW_SIZE)
//        SumOfSquares -= BufferWindow_CH1[Index] * BufferWindow_CH1[Index];  // Remove old squared value
//    else
//        Count++;
//
//    // Store new value and update sum of squares
//    BufferWindow_CH1[Index] = NewSampleValue;
//    SumOfSquares += NewSampleValue * NewSampleValue;
//
//    // Update RMS
//    RMS_CurrentValue = sqrt(SumOfSquares / Count);
//
//    // Move buffer index (circular)
//    Index = (Index + 1) % RMS_WINDOW_SIZE;
//
//    return(RMS_CurrentValue);
//}
//
//
//static float BufferWindow_CH2[RMS_WINDOW_SIZE] = {0};
//double update_CH2_RMS_Current(double NewSampleValue)
//{
//    static int Index = 0;
//    static int Count = 0;
//    static double SumOfSquares = 0.0;
//
//    double RMS_CurrentValue;
//    // Remove the oldest value from sum_squares if buffer is full
//    if (Count >= RMS_WINDOW_SIZE)
//        SumOfSquares -= BufferWindow_CH2[Index] * BufferWindow_CH2[Index];  // Remove old squared value
//    else
//        Count++;
//
//    // Store new value and update sum of squares
//    BufferWindow_CH2[Index] = NewSampleValue;
//    SumOfSquares += NewSampleValue * NewSampleValue;
//
//    // Update RMS
//    RMS_CurrentValue = sqrt(SumOfSquares / Count);
//
//    // Move buffer index (circular)
//    Index = (Index + 1) % RMS_WINDOW_SIZE;
//
//    return(RMS_CurrentValue);
//}
//
//
//static float BufferWindowVoltage_CH1[RMS_WINDOW_SIZE] = {0};
//double update_CH1_RMS_Voltage(double NewSampleValue)
//{
//    static int Index = 0;
//    static int Count = 0;
//    static double SumOfSquares = 0.0;
//
//    double RMS_CurrentValue;
//    // Remove the oldest value from sum_squares if buffer is full
//    if (Count >= RMS_WINDOW_SIZE)
//        SumOfSquares -= BufferWindowVoltage_CH1[Index] * BufferWindowVoltage_CH1[Index];  // Remove old squared value
//    else
//        Count++;
//
//    // Store new value and update sum of squares
//    BufferWindowVoltage_CH1[Index] = NewSampleValue;
//    SumOfSquares += NewSampleValue * NewSampleValue;
//
//    // Update RMS
//    RMS_CurrentValue = sqrt(SumOfSquares / Count);
//
//    // Move buffer index (circular)
//    Index = (Index + 1) % RMS_WINDOW_SIZE;
//
//    return(RMS_CurrentValue);
//}
//
//
//static float BufferWindowVoltage_CH2[RMS_WINDOW_SIZE] = {0};
//double update_CH2_RMS_Voltage(double NewSampleValue)
//{
//    static int Index = 0;
//    static int Count = 0;
//    static double SumOfSquares = 0.0;
//
//    double RMS_CurrentValue;
//    // Remove the oldest value from sum_squares if buffer is full
//    if (Count >= RMS_WINDOW_SIZE)
//        SumOfSquares -= BufferWindowVoltage_CH2[Index] * BufferWindowVoltage_CH2[Index];  // Remove old squared value
//    else
//        Count++;
//
//    // Store new value and update sum of squares
//    BufferWindowVoltage_CH2[Index] = NewSampleValue;
//    SumOfSquares += NewSampleValue * NewSampleValue;
//
//    // Update RMS
//    RMS_CurrentValue = sqrt(SumOfSquares / Count);
//
//    // Move buffer index (circular)
//    Index = (Index + 1) % RMS_WINDOW_SIZE;
//
//    return(RMS_CurrentValue);
//}
//
//
//
